---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.IncompleteShape
source: html/857db081-af18-84ae-86b2-03a01c04f9d3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.IncompleteShape Property

Rebar Shape [Family Name] is not fully defined and cannot be loaded into the project.

## Syntax (C#)
```csharp
public static FailureDefinitionId IncompleteShape { get; }
```